Aliceykr/2026G/STM32/App/Src/GSignalFlow.c
        if (Fpga_ReadCaptureStatus(&status) == 0U)
        {
            GSignalFlow_AbortCycle("status", "STAT ERR");
            return;
        }

        if ((status & FPGA_CAPTURE_STATUS_DONE) == 0UL)
        {
            if ((uint32_t)(now - s_CycleStartTick) >=
                G_FLOW_CAPTURE_TIMEOUT_MS)
            {
                GSignalFlow_AbortCycle("timeout", "TIMEOUT");
                return;
            }
            s_NextActionTick = now + G_FLOW_STATUS_POLL_MS;
            return;
        }

        if ((uint16_t)(status >> 16U) != FPGA_CAPTURE_FRAME_LENGTH)
        {
            GSignalFlow_AbortCycle("length", "LEN ERR");
            return;
        }
    }

    if (Fpga_ReadCaptureFrame(
            (s_State == G_FLOW_STATE_WAIT_WAVEFORM)
                ? s_WaveCaptureFrame : s_CaptureFrame,
            SPECTRUM_FRAME_LENGTH) == 0U)
    {
        GSignalFlow_AbortCycle("frame", "FRAME ERR");
        return;
    }

    if (s_State == G_FLOW_STATE_WAIT_ANALYSIS)
    {
        if (SpectrumAnalyzer_Run(s_CaptureFrame, &s_Result) == 0U)
        {
            if (s_Result.status == SPECTRUM_STATUS_NO_SIGNAL)
            {
                s_ActiveSequence = s_ReportSequence;
                s_ReportSequence++;
                s_AnalysisElapsedMs = HAL_GetTick() - s_CycleStartTick;
                GSignalFlow_SendNoSignal();
                GSignalFlow_UpdateHmiNoSignal();
            }
            else
            {
                GSignalFlow_AbortCycle("spectrum", "CALC ERR");
                return;
            }
            GSignalFlow_FinishCycle(HAL_GetTick());
            return;
        }

        s_ActiveSequence = s_ReportSequence;
        s_ReportSequence++;
        s_AnalysisElapsedMs = HAL_GetTick() - s_CycleStartTick;
        GSignalFlow_SendResult();
        if (GSignalFlow_SendMeasurement() == 0U)
        {
            GSignalFlow_AbortCycle("measurement", "CALC ERR");
            return;
        }

        if (s_ActiveMeasurementMode == G_FLOW_MODE_FREQUENCY)
        {
            GSignalFlow_UpdateHmiFrequencyMeasurement();
            (void)GSignalFlow_UpdateHmiSpectrum(1U);
            GSignalFlow_FinishCycle(HAL_GetTick());
            return;
        }

        GSignalFlow_UpdateHmiTimeMeasurement();
        s_TimeFundamentalHz = s_Result.fundamental_hz;

        if (Fpga_StartCapture(1U) == 0U)
        {
            GSignalFlow_AbortCycle("wave_start", "WAVE ERR");
            return;
        }

        s_State = G_FLOW_STATE_WAIT_WAVEFORM;
        s_NextActionTick = HAL_GetTick() + G_FLOW_STATUS_POLL_MS;
        return;
    }

    if (s_State == G_FLOW_STATE_WAIT_WAVEFORM)
    {
        if (s_CycleChangePending != 0U)
        {
            s_ActiveWaveformCycles = s_SelectedWaveformCycles;
            s_CycleChangePending = 0U;
        }

        if (GSignalFlow_BuildAndDisplayWaveform(
                s_ActiveWaveformCycles) == 0U)
        {
            GSignalFlow_AbortCycle("waveform", "WAVE ERR");
            return;
        }

        s_WaveFrameValid = 1U;
        GSignalFlow_FinishCycle(HAL_GetTick());
        return;
    }
}

static void GSignalFlow_StartOrRetry(uint32_t now)
{
    /* 没有收到明确的开始按键事件时，任何路径都不得启动FPGA采集。 */
    if (s_MeasurementEnabled == 0U)
    {
        s_State = G_FLOW_STATE_IDLE;
        return;
    }

    if (s_FpgaOnline == 0U)
    {
        s_FpgaOnline = Fpga_ReadId(&s_FpgaId);
        if (s_FpgaOnline == 0U)
        {
            GSignalFlow_AbortCycle("id", "ID ERR");
            return;
        }
    }

    if (Fpga_StartCapture(0U) == 0U)
    {
        GSignalFlow_AbortCycle("start", "START ERR");
        return;
    }

    memset(&s_Result, 0, sizeof(s_Result));
    memset(&s_Measurement, 0, sizeof(s_Measurement));
    if (s_ActiveMeasurementMode == G_FLOW_MODE_TIME)
    {
        memset(&s_Waveform, 0, sizeof(s_Waveform));
        s_WaveFrameValid = 0U;
        s_TimeFundamentalHz = 0.0f;
    }
    s_CycleStartTick = now;
    s_State = G_FLOW_STATE_WAIT_ANALYSIS;
    s_NextActionTick = now + G_FLOW_STATUS_POLL_MS;
}

static void GSignalFlow_FinishCycle(uint32_t now)
{
    (void)now;
    s_MeasurementEnabled = 0U;
    s_State = G_FLOW_STATE_HOLD;
    s_HmiReadyPending = 1U;
}

static void GSignalFlow_AbortCycle(const char *stage,
                                  const char *hmi_status)
{
    GSignalFlow_SendError(stage);
    s_MeasurementEnabled = 0U;
    s_State = G_FLOW_STATE_HOLD;
    if ((s_ActiveMeasurementMode != G_FLOW_MODE_NONE) &&
        (hmi_status != NULL))
    {
        s_HmiReadyPending = 0U;
        TjcHmi_SetStatusText(hmi_status);
    }
}

static void GSignalFlow_HandleCommand(void)
{
    TjcHmiEvent event;
    uint8_t requested_cycles = 0U;
    uint32_t now;

    if (TjcHmi_ReadEvent(&event, &requested_cycles) == 0U)
    {
        return;
    }

    now = HAL_GetTick();

    if (event == TJC_HMI_EVENT_START_MEASUREMENT)
    {
        if ((uint32_t)(now - s_LastStartEventTick) <
            G_FLOW_BUTTON_DEBOUNCE_MS)
        {
            return;
        }
        s_LastStartEventTick = now;

        /* FPGA采集链一次只执行一个任务，忙时不打断当前任务。 */
        if ((s_State != G_FLOW_STATE_IDLE) &&
            (s_State != G_FLOW_STATE_HOLD))
        {
            GSignalFlow_SendText("G_HMI,event=time,ignored=busy\r\n");
            return;
        }

        GSignalFlow_SendText("G_HMI,event=time\r\n");
        s_ActiveMeasurementMode = G_FLOW_MODE_TIME;
        TjcHmi_SetComputeBusy(1U);
        s_HmiBusyUntilTick = now + G_FLOW_HMI_BUSY_MIN_MS;
        s_HmiReadyPending = 0U;
        s_MeasurementEnabled = 1U;
        s_ActiveWaveformCycles = s_SelectedWaveformCycles;
        s_CycleChangePending = 0U;
        GSignalFlow_UpdateHmiTimePlaceholders();
        tjc_clear_wave("s0.id", 0);
        tjc_send_string("ref s0");
        s_State = G_FLOW_STATE_WAIT_RESTART;
        s_NextActionTick = now;
        return;
    }

    if (event == TJC_HMI_EVENT_FREQUENCY_MEASUREMENT)
    {
        if ((uint32_t)(now - s_LastFrequencyEventTick) <
            G_FLOW_BUTTON_DEBOUNCE_MS)
        {
            return;
        }
        s_LastFrequencyEventTick = now;

        if ((s_State != G_FLOW_STATE_IDLE) &&
            (s_State != G_FLOW_STATE_HOLD))
        {
            GSignalFlow_SendText(
                "G_HMI,event=frequency,ignored=busy\r\n");
            return;
        }

        GSignalFlow_SendText("G_HMI,event=frequency\r\n");
        s_ActiveMeasurementMode = G_FLOW_MODE_FREQUENCY;
        TjcHmi_SetComputeBusy(1U);
        s_HmiBusyUntilTick = now + G_FLOW_HMI_BUSY_MIN_MS;
        s_HmiReadyPending = 0U;
        s_MeasurementEnabled = 1U;
        GSignalFlow_UpdateHmiFrequencyPlaceholders();
        (void)GSignalFlow_UpdateHmiSpectrum(0U);
        s_State = G_FLOW_STATE_WAIT_RESTART;
        s_NextActionTick = now;
        return;
    }

