Aliceykr/2026G/STM32/App/Src/GSignalFlow.c
    if (event == TJC_HMI_EVENT_TOGGLE_CYCLES)
    {
        requested_cycles =
            (s_SelectedWaveformCycles == 1U) ? 3U : 1U;
    }

    if ((event == TJC_HMI_EVENT_TOGGLE_CYCLES) ||
        (event == TJC_HMI_EVENT_SET_CYCLES))
    {
        char buffer[64];
        const char *apply_mode;

        if ((uint32_t)(now - s_LastCycleEventTick) <
            G_FLOW_BUTTON_DEBOUNCE_MS)
        {
            return;
        }
        s_LastCycleEventTick = now;

        if (GSignalFlow_SetWaveformCycles(requested_cycles) == 0U)
        {
            return;
        }

        if ((s_ActiveMeasurementMode == G_FLOW_MODE_TIME) &&
            ((s_State == G_FLOW_STATE_WAIT_RESTART) ||
             (s_State == G_FLOW_STATE_WAIT_ANALYSIS) ||
             (s_State == G_FLOW_STATE_WAIT_WAVEFORM)))
        {
            /* b0时域任务中只排队更新s0，不影响任何频域显示。 */
            s_CycleChangePending = 1U;
            apply_mode = "queued";
        }
        else if (s_WaveFrameValid != 0U)
        {
            /* 始终使用最近一次b0缓存的5MSPS帧，只重画s0。 */
            s_ActiveWaveformCycles = s_SelectedWaveformCycles;
            if (GSignalFlow_BuildAndDisplayWaveform(
                    s_ActiveWaveformCycles) != 0U)
            {
                apply_mode = "redraw";
            }
            else
            {
                apply_mode = "error";
            }
        }
        else
        {
            s_ActiveWaveformCycles = s_SelectedWaveformCycles;
            apply_mode = "next";
        }

        (void)snprintf(buffer,
                       sizeof(buffer),
                       "G_HMI,event=cycles,value=%u,apply=%s\r\n",
                       (unsigned int)s_SelectedWaveformCycles,
                       apply_mode);
        GSignalFlow_SendText(buffer);
    }
}

static void GSignalFlow_SendText(const char *text)
{
#if G_FLOW_ASCII_DEBUG_ENABLED != 0U
    size_t length;

    if (text == NULL)
    {
        return;
    }

    length = strlen(text);
    if (length > 0xFFFFU)
    {
        length = 0xFFFFU;
    }

    (void)GSerial_Transmit((const uint8_t *)text,
                           (uint16_t)length,
                           G_FLOW_UART_TIMEOUT_MS);
#else
    (void)text;
#endif
}

static void GSignalFlow_SendStartup(void)
{
    char buffer[96];

    (void)snprintf(buffer,
                   sizeof(buffer),
                   "G_FLOW,boot,id=0x%08lX,online=%u,fs=1250000,n=4096\r\n",
                   (unsigned long)s_FpgaId,
                   (unsigned int)s_FpgaOnline);
    GSignalFlow_SendText(buffer);
}

static void GSignalFlow_SendError(const char *stage)
{
    char buffer[96];

    (void)snprintf(buffer,
                   sizeof(buffer),
                   "G_FLOW,error=%s,seq=%lu\r\n",
                   stage,
                   (unsigned long)s_ReportSequence);
    GSignalFlow_SendText(buffer);
}

static void GSignalFlow_SendNoSignal(void)
{
    char buffer[128];

    (void)snprintf(
        buffer,
        sizeof(buffer),
        "G_FLOW,no_signal,seq=%lu,t_ms=%lu,under2s=%u,threshold=%u\r\n",
        (unsigned long)s_ActiveSequence,
        (unsigned long)s_AnalysisElapsedMs,
        (unsigned int)((s_AnalysisElapsedMs <=
                        G_FLOW_RESPONSE_LIMIT_MS) ? 1U : 0U),
        (unsigned int)SPECTRUM_MIN_VALID_AMPLITUDE_CODES);
    GSignalFlow_SendText(buffer);
}

static void GSignalFlow_SendResult(void)
{
    char buffer[256];
    int written;
    uint8_t component;

    written = snprintf(buffer,
                       sizeof(buffer),
                       "G_FLOW,seq=%lu,f0=%luHz,n=%u,rms=%lu,vpp=%lu,t_ms=%lu,under2s=%u",
                       (unsigned long)s_ActiveSequence,
                       (unsigned long)GSignalFlow_RoundPositive(s_Result.fundamental_hz),
                       (unsigned int)s_Result.component_count,
                       (unsigned long)GSignalFlow_RoundPositive(s_Result.rms_codes),
                       (unsigned long)GSignalFlow_RoundPositive(s_Result.vpp_codes),
                       (unsigned long)s_AnalysisElapsedMs,
                       (unsigned int)((s_AnalysisElapsedMs <=
                                       G_FLOW_RESPONSE_LIMIT_MS) ? 1U : 0U));

    if (written < 0)
    {
        return;
    }

    for (component = 0U;
         (component < s_Result.component_count) &&
         ((size_t)written < sizeof(buffer));
         component++)
    {
        const SpectrumComponent *item = &s_Result.components[component];
        int appended = snprintf(&buffer[written],
                                sizeof(buffer) - (size_t)written,
                                ",h%u=%luHz:%lu",
                                (unsigned int)item->harmonic,
                                (unsigned long)GSignalFlow_RoundPositive(item->frequency_hz),
                                (unsigned long)GSignalFlow_RoundPositive(item->amplitude_codes));

        if (appended < 0)
        {
            break;
        }

        if ((size_t)appended >= sizeof(buffer) - (size_t)written)
        {
            written = (int)(sizeof(buffer) - 1U);
            break;
        }

        written += appended;
    }

    if ((size_t)written < sizeof(buffer))
    {
        int appended;

        if (s_Result.spur_valid != 0U)
        {
            appended = snprintf(&buffer[written],
                                sizeof(buffer) - (size_t)written,
                                ",spur=%luHz:%lu",
                                (unsigned long)GSignalFlow_RoundPositive(
                                    s_Result.spur_frequency_hz),
                                (unsigned long)GSignalFlow_RoundPositive(
                                    s_Result.spur_amplitude_codes));
        }
        else
        {
            appended = snprintf(&buffer[written],
                                sizeof(buffer) - (size_t)written,
                                ",spur=none");
        }

        if (appended >= 0)
        {
            if ((size_t)appended >=
                sizeof(buffer) - (size_t)written)
            {
                written = (int)(sizeof(buffer) - 1U);
            }
            else
            {
                written += appended;
            }
        }
    }

    if ((size_t)written + 2U < sizeof(buffer))
    {
        buffer[written++] = '\r';
        buffer[written++] = '\n';
        buffer[written] = '\0';
    }
    else
    {
        buffer[sizeof(buffer) - 3U] = '\r';
        buffer[sizeof(buffer) - 2U] = '\n';
        buffer[sizeof(buffer) - 1U] = '\0';
    }

