Aliceykr/2026G/STM32/App/Src/GSignalFlow.c
    GSignalFlow_SendText(buffer);
}

static uint8_t GSignalFlow_SendMeasurement(void)
{
    char buffer[256];
    int written;
    uint8_t component;

    if (GMeasurement_Convert(&s_Result,
                             GMeasurementCalibration_Get(),
                             &s_Measurement) == 0U)
    {
        (void)snprintf(buffer,
                       sizeof(buffer),
                       "G_MEAS,seq=%lu,cal=0,reason=no_mv_table\r\n",
                       (unsigned long)s_ActiveSequence);
        GSignalFlow_SendText(buffer);
        return 0U;
    }

    written = snprintf(
        buffer,
        sizeof(buffer),
        "G_MEAS,seq=%lu,cal=1,f0=%luHz,upp=%lumV,urms=%lumV,n=%u",
        (unsigned long)s_ActiveSequence,
        (unsigned long)GSignalFlow_RoundPositive(
            s_Measurement.fundamental_hz),
        (unsigned long)GSignalFlow_RoundPositive(s_Measurement.upp_mv),
        (unsigned long)GSignalFlow_RoundPositive(s_Measurement.urms_mv),
        (unsigned int)s_Measurement.component_count);

    if (written < 0)
    {
        return 0U;
    }

    for (component = 0U;
         (component < s_Measurement.component_count) &&
         ((size_t)written < sizeof(buffer));
         component++)
    {
        const GMeasurementComponent *item =
            &s_Measurement.components[component];
        int appended = snprintf(
            &buffer[written],
            sizeof(buffer) - (size_t)written,
            ",h%u=%luHz:%lumV",
            (unsigned int)item->harmonic,
            (unsigned long)GSignalFlow_RoundPositive(item->frequency_hz),
            (unsigned long)GSignalFlow_RoundPositive(item->amplitude_mv));

        if (appended < 0)
        {
            break;
        }
        if ((size_t)appended >= sizeof(buffer) - (size_t)written)
        {
            written = (int)(sizeof(buffer) - 1U);
            break;
        }
        written += appended;
    }

    if ((size_t)written + 2U < sizeof(buffer))
    {
        buffer[written++] = '\r';
        buffer[written++] = '\n';
        buffer[written] = '\0';
    }
    else
    {
        buffer[sizeof(buffer) - 3U] = '\r';
        buffer[sizeof(buffer) - 2U] = '\n';
        buffer[sizeof(buffer) - 1U] = '\0';
    }

    GSignalFlow_SendText(buffer);
    return 1U;
}

static void GSignalFlow_UpdateHmiTimeMeasurement(void)
{
    GSignalFlow_UpdateHmiMeasurementField(0U);
    GSignalFlow_UpdateHmiMeasurementField(1U);
    GSignalFlow_UpdateHmiMeasurementField(2U);
}

static void GSignalFlow_UpdateHmiFrequencyMeasurement(void)
{
    GSignalFlow_UpdateHmiMeasurementField(3U);
    GSignalFlow_UpdateHmiMeasurementField(4U);
    GSignalFlow_UpdateHmiMeasurementField(5U);
}

static void GSignalFlow_ServiceHmiMeasurement(void)
{
    if ((s_HmiReadyPending != 0U) &&
        ((int32_t)(HAL_GetTick() - s_HmiBusyUntilTick) >= 0))
    {
        TjcHmi_SetComputeBusy(0U);
        s_HmiReadyPending = 0U;
    }
}

static void GSignalFlow_UpdateHmiMeasurementField(uint8_t field)
{
    char text[64];
    char value_text[24];
    const char *object_name;

    if (field == 0U)
    {
        (void)snprintf(text,
                       sizeof(text),
                       "F=%luHZ",
                       (unsigned long)GSignalFlow_RoundPositive(
                           s_Measurement.fundamental_hz));
        tjc_send_txt("t0", "txt", text);
        return;
    }
    if (field == 1U)
    {
        GSignalFlow_FormatFixed2(s_Measurement.upp_mv,
                                 value_text,
                                 sizeof(value_text));
        (void)snprintf(text,
                       sizeof(text),
                       "Vpp=%s mV",
                       value_text);
        tjc_send_txt("t1", "txt", text);
        return;
    }
    if (field == 2U)
    {
        GSignalFlow_FormatFixed2(s_Measurement.urms_mv,
                                 value_text,
                                 sizeof(value_text));
        (void)snprintf(text,
                       sizeof(text),
                       "Vrms=%s mV",
                       value_text);
        tjc_send_txt("t2", "txt", text);
        return;
    }

    if (field <= 5U)
    {
        uint8_t slot = (uint8_t)(field - 3U);
        const GMeasurementComponent *item = NULL;

        object_name = (field == 3U) ? "t3" :
                      ((field == 4U) ? "t4" : "t5");

        if (slot < s_Measurement.component_count)
        {
            item = &s_Measurement.components[slot];
        }

        if (item != NULL)
        {
            GSignalFlow_FormatFixed2(item->amplitude_mv,
                                     value_text,
                                     sizeof(value_text));
            (void)snprintf(text,
                           sizeof(text),
                           "H%u=%luHZ,%smV",
                           (unsigned int)item->harmonic,
                           (unsigned long)GSignalFlow_RoundPositive(
                               item->frequency_hz),
                           value_text);
        }
        else
        {
            (void)snprintf(text,
                           sizeof(text),
                           "H=XXXHZ,XXX.XXmV");
        }
        tjc_send_txt(object_name, "txt", text);
        return;
    }
}

static void GSignalFlow_UpdateHmiPlaceholders(void)
{
    GSignalFlow_UpdateHmiTimePlaceholders();
    GSignalFlow_UpdateHmiFrequencyPlaceholders();
}

static void GSignalFlow_UpdateHmiTimePlaceholders(void)
{
    tjc_send_txt("t0", "txt", "F=XXXHZ");
    tjc_send_txt("t1", "txt", "Vpp=XXX mV");
    tjc_send_txt("t2", "txt", "Vrms=XXX mV");
}

static void GSignalFlow_UpdateHmiFrequencyPlaceholders(void)
{
    uint8_t field;

    for (field = 3U; field <= 5U; field++)
    {
        char object_name[3] = {'t', (char)('0' + field), '\0'};
        char text[28];

        (void)snprintf(text,
                       sizeof(text),
                       "H=XXXHZ,XXX.XXmV");
        tjc_send_txt(object_name, "txt", text);
    }
}

static void GSignalFlow_UpdateHmiNoSignal(void)
{
    if (s_ActiveMeasurementMode == G_FLOW_MODE_TIME)
    {
        GSignalFlow_UpdateHmiTimePlaceholders();
        tjc_clear_wave("s0.id", 0);
        tjc_send_string("ref s0");
    }
    else if (s_ActiveMeasurementMode == G_FLOW_MODE_FREQUENCY)
    {
        GSignalFlow_UpdateHmiFrequencyPlaceholders();
        (void)GSignalFlow_UpdateHmiSpectrum(0U);
    }
}

static uint8_t GSignalFlow_UpdateHmiSpectrum(uint8_t signal_valid)
{
    uint16_t display_points = s_SpectrumDisplayPoints;
    uint8_t width_ready = 1U;

