Aliceykr/2026G/STM32/App/Src/GSignalFlow.c
    minimum = (int32_t)s_Waveform.minimum_code;
    peak = (minimum < 0) ? -minimum : minimum;
    if ((int32_t)s_Waveform.maximum_code > peak)
    {
        peak = (int32_t)s_Waveform.maximum_code;
    }

    if (display_points == 0U)
    {
        if (TjcHmi_GetComponentWidth("s0", &display_points) != 0U)
        {
            s_WaveDisplayPoints = display_points;
        }
        else
        {
            display_points = G_FLOW_WAVE_FALLBACK_POINTS;
        }
    }
    if (display_points > G_FLOW_WAVE_MAX_POINTS)
    {
        display_points = G_FLOW_WAVE_MAX_POINTS;
    }

    for (point = 0U; point < display_points; point++)
    {
        uint32_t source_numerator =
            (uint32_t)point *
            (uint32_t)(s_Waveform.point_count - 1U);
        uint16_t source_index = (uint16_t)(
            source_numerator / (display_points - 1U));
        uint32_t source_remainder =
            source_numerator % (display_points - 1U);
        uint16_t next_index =
            (source_index + 1U < s_Waveform.point_count)
            ? (uint16_t)(source_index + 1U)
            : source_index;
        int32_t interpolated =
            ((int32_t)s_Waveform.points[source_index] *
             (int32_t)((display_points - 1U) -
                       source_remainder) +
             (int32_t)s_Waveform.points[next_index] *
             (int32_t)source_remainder) /
            (int32_t)(display_points - 1U);

        if (peak <= 0)
        {
            s_WaveDisplay[point] =
                (uint8_t)(127 / G_FLOW_WAVE_HEIGHT_DIVISOR +
                          G_FLOW_WAVE_VERTICAL_OFFSET);
        }
        else
        {
            /*
             * 波形数据已去除直流均值，因此以0码为固定中线并按正负峰值
             * 对称缩放。这样稀疏采样造成的正负峰值轻微不一致不会让屏幕
             * 中线漂移，1/3高度和+20偏移仍保持原页面布局。
             */
            int32_t original_height = 127 + (interpolated * 127) / peak;
            int32_t scaled = original_height /
                             (int32_t)G_FLOW_WAVE_HEIGHT_DIVISOR +
                             (int32_t)G_FLOW_WAVE_VERTICAL_OFFSET;

            if (scaled < 0)
            {
                scaled = 0;
            }
            if (scaled > 254)
            {
                scaled = 254;
            }
            s_WaveDisplay[point] = (uint8_t)scaled;
        }
    }

    /*
     * 当前淘晶驰s0的addt显示方向与时间数组索引相反。发送前将整组数据
     * 左右镜像，使屏幕从左到右对应波形时间从早到晚；只影响s0，不改变
     * s1频谱方向和1/3周期选择。
     */
    for (point = 0U; point < display_points / 2U; point++)
    {
        uint16_t mirror = (uint16_t)(display_points - 1U - point);
        uint8_t temporary = s_WaveDisplay[point];

        s_WaveDisplay[point] = s_WaveDisplay[mirror];
        s_WaveDisplay[mirror] = temporary;
    }

    tjc_clear_wave("s0.id", 0);
    return tjc_send_wave("s0.id",
                         0,
                         s_WaveDisplay,
                         display_points);
}

static uint32_t GSignalFlow_RoundPositive(float value)
{
    if (value <= 0.0f)
    {
        return 0UL;
    }

    if (value >= 4294967040.0f)
    {
        return 0xFFFFFFFFUL;
    }

    return (uint32_t)(value + 0.5f);
}

static void GSignalFlow_FormatFixed2(float value,
                                     char *buffer,
                                     size_t buffer_size)
{
    uint32_t scaled;

    if ((buffer == NULL) || (buffer_size == 0U))
    {
        return;
    }

    scaled = GSignalFlow_RoundPositive(value * 100.0f);
    (void)snprintf(buffer,
                   buffer_size,
                   "%lu.%02lu",
                   (unsigned long)(scaled / 100UL),
                   (unsigned long)(scaled % 100UL));
}

const GMeasurementResult *GSignalFlow_GetLatestMeasurement(void)
{
    return &s_Measurement;
}

uint8_t GSignalFlow_SetWaveformCycles(uint8_t cycles)
{
    if ((cycles != 1U) && (cycles != 3U))
    {
        return 0U;
    }

    s_SelectedWaveformCycles = cycles;
    return 1U;
}

const GMeasurementWaveform *GSignalFlow_GetLatestWaveform(void)
{
    return &s_Waveform;
}
